In [ ]:
Interaction with web APIs

In [11]:
import requests 
import pandas as pd

In [2]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [4]:
resp = requests.get(url)

In [5]:
resp

In [6]:
data = resp.json()

In [7]:
data[0]['title']

'BUG: Categorical.take with fill_value'

In [12]:
issues = pd.DataFrame(data, columns=['number', 'title',
.....: 'labels', 'state'])

In [13]:
issues

,number,title,labels,state
0,23296,BUG: Categorical.take with fill_value,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
1,23294,TST: stricter monotonicity/uniqueness tests (p...,[],open
2,23293,[WIP] Add __array_ufunc__ to Series / Array,[],open
3,23292,Barplot add space option,[],open
4,23291,BUG: Let MultiIndex.set_levels accept any iter...,[],open
5,23289,BUG GH23282 calling min on series of NaT retur...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
6,23288,CLN: simplify try_coerce_args,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
7,23287,TST: rdivmod on EA Arrays,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
8,23286,TST: revert xfails on gbq & feather,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
9,23285,[WIP]Preserve EA dtype in DataFrame.stack,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
10,23284,ENH: Support EAs in Series.unstack,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
11,23283,Write partitioned Parquet file using to_parquet,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
12,23282,".min() on a series of NaTs returns nan, while ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,23279,DOC: Added a Multi Index example for the Serie...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
14,23273,pandas.MultiIndex.set_levels does not accept g...,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
15,23264,DEPR: Add Deprecated warning for timedelta wit...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
16,23263,DOC: Updated the docstring of Series.rank / Da...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,23262,BUG: merging an Integer EA rasises,[],open
18,23261,Add tests in methods.py,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
19,23259,DOC: Fixed timedelta docstring and examples,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
20,23255,ENH:Add EA types to read CSV,[],open
21,23254,read_fwf: encoding is ignored when memory_map ...,"[{'id': 2301354, 'node_id': 'MDU6TGFiZWwyMzAxM...",open
22,23253,datetimeindex.to_period not behaving as expect...,"[{'id': 60635328, 'node_id': 'MDU6TGFiZWw2MDYz...",open
23,23252,"ENH: Allow keep=""all"" in duplicated method (#2...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
24,23251,"ENH: Allow use of keep=""all"" in duplicated","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
25,23249,CLN:Remove unused **kwargs from user facing me...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
26,23248,Datetime units not listed in pd.to_timedelta d...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,23247,Adding fixtures to series tests as per #22550,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
28,23245,DOC: Fixing test and validate docstrings for s...,[],open
29,23242,Missing Values and Categoricals - inconsistent...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open

Interaction with Databases

In [14]:
import sqlite3

In [15]:
query = """
.....: CREATE TABLE test
.....: (a VARCHAR(20), b VARCHAR(20),
.....: c REAL, d INTEGER
.....: );"""

In [16]:
con = sqlite3.connect('mydata.sqlite')

In [17]:
con.execute(query)

In [18]:
con.commit()

In [19]:
data = [('Atlanta', 'Georgia', 1.25, 6),
.....: ('Tallahassee', 'Florida', 2.6, 3),
.....: ('Sacramento', 'California', 1.7, 5)]

In [20]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [21]:
con.executemany(stmt, data)

In [22]:
con.commit()

In [23]:
cursor = con.execute('select * from test')

In [24]:
rows = cursor.fetchall()

In [25]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [26]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [27]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [28]:
import sqlalchemy as sqla

In [29]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [30]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5